[CreditInfo]
$*CreditInfo-1-description=<font color='#d99e36'><font size='36'>CREATORS OF BLESS</font>
$*CreditInfo-2-description=
$*CreditInfo-3-description=
$*CreditInfo-4-description=
$*CreditInfo-5-description=
$*CreditInfo-6-description=
$*CreditInfo-7-description=<font color='#d99e36'><font size='18'>DIRECTOR</FONT>
$*CreditInfo-8-description=
$*CreditInfo-9-description=Creative Director
$*CreditInfo-10-description=Jaehoon Jeon
$*CreditInfo-11-description=
$*CreditInfo-12-description=Lead Producer
$*CreditInfo-13-description=Jehyuk Lee
$*CreditInfo-14-description=
$*CreditInfo-15-description=
$*CreditInfo-16-description=
$*CreditInfo-17-description=<font color='#d99e36'><font size='18'>PRODUCTION</FONT>
$*CreditInfo-18-description=
$*CreditInfo-19-description=Producer
$*CreditInfo-20-description=Junghyun Lee
$*CreditInfo-21-description=Hugyu Bak
$*CreditInfo-22-description=
$*CreditInfo-23-description=
$*CreditInfo-24-description=
$*CreditInfo-25-description=<font color='#d99e36'><font size='18'>GAME DESIGN</FONT>
$*CreditInfo-26-description=
$*CreditInfo-27-description=Lead Designer
$*CreditInfo-28-description=Hyungjae Chun
$*CreditInfo-29-description=
$*CreditInfo-30-description=Senior Level Designer
$*CreditInfo-31-description=Hyelim Lee
$*CreditInfo-32-description=
$*CreditInfo-33-description=Level Designer
$*CreditInfo-34-description=Gahyeon Lee
$*CreditInfo-35-description=
$*CreditInfo-36-description=Senior Balance Designer
$*CreditInfo-37-description=Jinwoo Baek
$*CreditInfo-38-description=
$*CreditInfo-39-description=Balance Designer
$*CreditInfo-40-description=Sangsang Kim
$*CreditInfo-41-description=Jungeon Jang
$*CreditInfo-42-description=Younghan Leem
$*CreditInfo-43-description=
$*CreditInfo-44-description=Senior Combat Designer
$*CreditInfo-45-description=Seongil Ma
$*CreditInfo-46-description=
$*CreditInfo-47-description=Combat Designer
$*CreditInfo-48-description=Minjung Kim
$*CreditInfo-49-description=Jinyul Kim
$*CreditInfo-50-description=Hyuksung Kwon
$*CreditInfo-51-description=Hyungyu Kang
$*CreditInfo-52-description=Junhyun Jeon
$*CreditInfo-53-description=
$*CreditInfo-54-description=Senior System Designer
$*CreditInfo-55-description=Junyoung Hwang
$*CreditInfo-56-description=
$*CreditInfo-57-description=System Designer
$*CreditInfo-58-description=Kyungrok Sang
$*CreditInfo-59-description=Yeongin Yun
$*CreditInfo-60-description=Chungyu Ryu
$*CreditInfo-61-description=
$*CreditInfo-62-description=
$*CreditInfo-63-description=
$*CreditInfo-64-description=<font color='#d99e36'><font size='18'>GAME PROGRAMMING</FONT>
$*CreditInfo-65-description=
$*CreditInfo-66-description=Lead Programmer
$*CreditInfo-67-description=Jeongho Kim
$*CreditInfo-68-description=
$*CreditInfo-69-description=Server Programmer
$*CreditInfo-70-description=Jongho Kim
$*CreditInfo-71-description=Myungku Kim
$*CreditInfo-72-description=Eunkyu Lee
$*CreditInfo-73-description=Jihoon Gwak
$*CreditInfo-74-description=Soyoung Lee
$*CreditInfo-75-description=
$*CreditInfo-76-description=Client Programmer
$*CreditInfo-77-description=Inwoo Jo
$*CreditInfo-78-description=Sungin Kim
$*CreditInfo-79-description=Huiho Lee
$*CreditInfo-80-description=Supyeong Chae
$*CreditInfo-81-description=Byunghee Yoo
$*CreditInfo-82-description=Jinwon Lee
$*CreditInfo-83-description=Heehwan Moon
$*CreditInfo-84-description=Hyeunjae Seo
$*CreditInfo-85-description=Hyungwook Kim
$*CreditInfo-86-description=Hanho Lee
$*CreditInfo-87-description=Jinhee Kang
$*CreditInfo-88-description=Hyoyoung Kim
$*CreditInfo-89-description=
$*CreditInfo-90-description=Technology development
$*CreditInfo-91-description=Manho Park
$*CreditInfo-92-description=
$*CreditInfo-93-description=
$*CreditInfo-94-description=
$*CreditInfo-95-description=<font color='#d99e36'><font size='18'>GAME ART</FONT>
$*CreditInfo-96-description=
$*CreditInfo-97-description=Art Director
$*CreditInfo-98-description=Daeeok Park
$*CreditInfo-99-description=
$*CreditInfo-100-description=UI Designer
$*CreditInfo-101-description=Eunsol Yeom
$*CreditInfo-102-description=Suji Kim
$*CreditInfo-103-description=Byungho Lee
$*CreditInfo-104-description=
$*CreditInfo-105-description=Lead Character Artist
$*CreditInfo-106-description=Eunjung Kang
$*CreditInfo-107-description=
$*CreditInfo-108-description=Character Modeler
$*CreditInfo-109-description=Geonwoo Kim
$*CreditInfo-110-description=Hyun An
$*CreditInfo-111-description=Sungyun Kim
$*CreditInfo-112-description=Jihyun Park
$*CreditInfo-113-description=Jungok Ham
$*CreditInfo-114-description=
$*CreditInfo-115-description=Character Artist
$*CreditInfo-116-description=Juchan Yun
$*CreditInfo-117-description=Hyejeong Hwang
$*CreditInfo-118-description=Seongbae Lee
$*CreditInfo-119-description=
$*CreditInfo-120-description=Lead Motion effect artist
$*CreditInfo-121-description=Kibum Hahm
$*CreditInfo-122-description=
$*CreditInfo-123-description=Motion effect artist
$*CreditInfo-124-description=Jinsoo Jeon
$*CreditInfo-125-description=Geunyeong Kim
$*CreditInfo-126-description=
$*CreditInfo-127-description=Animator
$*CreditInfo-128-description=Hoyeong Jeong
$*CreditInfo-129-description=Eunkyung Kim
$*CreditInfo-130-description=Dongil Son
$*CreditInfo-131-description=Jongwon Lee
$*CreditInfo-132-description=
$*CreditInfo-133-description=Dungeon Artist
$*CreditInfo-134-description=Sungho Yun
$*CreditInfo-135-description=Junghwa Kim
$*CreditInfo-136-description=Hyunjung Choi
$*CreditInfo-137-description=Yunjeong Kim
$*CreditInfo-138-description=
$*CreditInfo-139-description=Environment Concept Artist
$*CreditInfo-140-description=Sungyon Lee
$*CreditInfo-141-description=Myounghoon Park
$*CreditInfo-142-description=
$*CreditInfo-143-description=Cinematics Lead
$*CreditInfo-144-description=Minsung Park
$*CreditInfo-145-description=
$*CreditInfo-146-description=Cinematic Animator
$*CreditInfo-147-description=Sungjoo Lee
$*CreditInfo-148-description=Hyeonseok Kang
$*CreditInfo-149-description=
$*CreditInfo-150-description=Cinematic Artist
$*CreditInfo-151-description=Youngjin Cho
$*CreditInfo-152-description=
$*CreditInfo-153-description=Technical Artist
$*CreditInfo-154-description=Changkyu Kim
$*CreditInfo-155-description=
$*CreditInfo-156-description=
$*CreditInfo-157-description=
$*CreditInfo-158-description=<font color='#d99e36'><font size='18'>GAME SOUND</FONT>
$*CreditInfo-159-description=
$*CreditInfo-160-description=Lead sound designer
$*CreditInfo-161-description=Kyeongho Cheon
$*CreditInfo-162-description=
$*CreditInfo-163-description=Sound designer
$*CreditInfo-164-description=Kwangsok O
$*CreditInfo-165-description=Woong Yoon
$*CreditInfo-166-description=Hyeonhee Park
$*CreditInfo-167-description=
$*CreditInfo-168-description=
$*CreditInfo-169-description=
$*CreditInfo-170-description=<font color='#d99e36'><font size='18'>QUALITY ASSURANCE</FONT>
$*CreditInfo-171-description=
$*CreditInfo-172-description=QA Manager
$*CreditInfo-173-description=Jusun Han
$*CreditInfo-174-description=
$*CreditInfo-175-description=QA
$*CreditInfo-176-description=Donghyun Kim
$*CreditInfo-177-description=Jiwon Han
$*CreditInfo-178-description=Woongkyoo Kim
$*CreditInfo-179-description=Minwoo Hwang
$*CreditInfo-180-description=Sanghyun Kim
$*CreditInfo-181-description=Hanjun Lee
$*CreditInfo-182-description=Jihyun Kim
$*CreditInfo-183-description=
$*CreditInfo-184-description=
$*CreditInfo-185-description=
$*CreditInfo-186-description=<font color='#d99e36'><font size='18'>TECHNICAL SUPPORT</FONT>
$*CreditInfo-187-description=
$*CreditInfo-188-description=Head of Technical Support
$*CreditInfo-189-description=Taegeun Bae
$*CreditInfo-190-description=
$*CreditInfo-191-description=Tech Director
$*CreditInfo-192-description=Hyoseen Park
$*CreditInfo-193-description=
$*CreditInfo-194-description=Technical Project Manager
$*CreditInfo-195-description=Castellan Lee
$*CreditInfo-196-description=
$*CreditInfo-197-description=WIC Developer
$*CreditInfo-198-description=Jongho Lee
$*CreditInfo-199-description=
$*CreditInfo-200-description=Launcher Developer
$*CreditInfo-201-description=Dragonwiz Lee
$*CreditInfo-202-description=Myeongjin Kim
$*CreditInfo-203-description=
$*CreditInfo-204-description=Middleware Developer
$*CreditInfo-205-description=Sungje Lee
$*CreditInfo-206-description=
$*CreditInfo-207-description=Frontend Developer
$*CreditInfo-208-description=Taylor Jang
$*CreditInfo-209-description=Hansang Bae
$*CreditInfo-210-description=
$*CreditInfo-211-description=System Engineer
$*CreditInfo-212-description=Sunpil Jun
$*CreditInfo-213-description=Seong-ryong Hong
$*CreditInfo-214-description=
$*CreditInfo-215-description=DBA
$*CreditInfo-216-description=Pilho Park
$*CreditInfo-217-description=Jongwon Kim
$*CreditInfo-218-description=Jinhwan Jung
$*CreditInfo-219-description=Kisun Hong
$*CreditInfo-220-description=
$*CreditInfo-221-description=Data Analyst
$*CreditInfo-222-description=Seongtaek Kim
$*CreditInfo-223-description=
$*CreditInfo-224-description=Technical Leader
$*CreditInfo-225-description=Gollum Yoon
$*CreditInfo-226-description=
$*CreditInfo-227-description=PMO
$*CreditInfo-228-description=Daesung Lim
$*CreditInfo-229-description=
$*CreditInfo-230-description=Tech PMO
$*CreditInfo-231-description=Hyunmoo Choi
$*CreditInfo-232-description=
$*CreditInfo-233-description=Launcher System Planner
$*CreditInfo-234-description=Jungsoo Park
$*CreditInfo-235-description=
$*CreditInfo-236-description=Security
$*CreditInfo-237-description=Junkil Eom
$*CreditInfo-238-description=Seungho Lee
$*CreditInfo-239-description=
$*CreditInfo-240-description=
$*CreditInfo-241-description=
$*CreditInfo-242-description=<font color='#d99e36'><font size='18'>GLOBAL PUBLISHING</FONT>
$*CreditInfo-243-description=
$*CreditInfo-244-description=Executive Producer
$*CreditInfo-245-description=Sungjin Ko
$*CreditInfo-246-description=Seoyeol Kim
$*CreditInfo-247-description=Seunghwan Sin
$*CreditInfo-248-description=Sung-eun Lyu
$*CreditInfo-249-description=Eunyoung Kim
$*CreditInfo-250-description=Yeeun Baik
$*CreditInfo-251-description=Eunhye Kim
$*CreditInfo-252-description=Jaehyang Yoo
$*CreditInfo-253-description=Jiyoung Park
$*CreditInfo-254-description=Grace Wah-Chee Kung
$*CreditInfo-255-description=Aysha Al-Masri Tudela
$*CreditInfo-256-description=Youngtae Yoon
$*CreditInfo-257-description=Chansoo Park
$*CreditInfo-258-description=Kihong Yoo
$*CreditInfo-259-description=Hyun-woo Cho
$*CreditInfo-260-description=Sangbaek Ju
$*CreditInfo-261-description=Bosong Shim
$*CreditInfo-262-description=Seongeun Kim
$*CreditInfo-263-description=Seulbi Lee
$*CreditInfo-264-description=Yuri Kim
$*CreditInfo-265-description=Chorong Im
$*CreditInfo-266-description=
$*CreditInfo-267-description=
$*CreditInfo-268-description=
$*CreditInfo-269-description=<font color='#d99e36'><font size='18'>WEB PRODUCTION</FONT>
$*CreditInfo-270-description=
$*CreditInfo-271-description=Service QA
$*CreditInfo-272-description=Cheong Ha
$*CreditInfo-273-description=Hongju Do
$*CreditInfo-274-description=Namju Jeong
$*CreditInfo-275-description=
$*CreditInfo-276-description=Lead Web Designer
$*CreditInfo-277-description=Donghyun Yang
$*CreditInfo-278-description=
$*CreditInfo-279-description=Web Designer
$*CreditInfo-280-description=Gahyun Kim
$*CreditInfo-281-description=
$*CreditInfo-282-description=Web Developer
$*CreditInfo-283-description=Yunhee Jung
$*CreditInfo-284-description=
$*CreditInfo-285-description=
$*CreditInfo-286-description=
$*CreditInfo-287-description=<font color='#d99e36'><font size='18'>ADMINISTRATIVE SUPPORT</FONT>
$*CreditInfo-288-description=
$*CreditInfo-289-description=Legal
$*CreditInfo-290-description=Ayoung Shin
$*CreditInfo-291-description=Haeri Yeo
$*CreditInfo-292-description=Seonho Shin
$*CreditInfo-293-description=
$*CreditInfo-294-description=Administration & HR
$*CreditInfo-295-description=Hyojin Kim
$*CreditInfo-296-description=Soyoung Jeon
$*CreditInfo-297-description=Sunhee Choi
$*CreditInfo-298-description=Jeehea Gwak
$*CreditInfo-299-description=Myungdong Kim
$*CreditInfo-300-description=Yoonho Kang
$*CreditInfo-301-description=Mijin Hong
$*CreditInfo-302-description=
$*CreditInfo-303-description=Accounting
$*CreditInfo-304-description=Heajin Choi
$*CreditInfo-305-description=Minwoo Yang
$*CreditInfo-306-description=
$*CreditInfo-307-description=
$*CreditInfo-308-description=
$*CreditInfo-309-description=<font color='#d99e36'><font size='18'>EXECUTIVES</FONT>
$*CreditInfo-310-description=
$*CreditInfo-311-description=CEO
$*CreditInfo-312-description=Kiwon Lee
$*CreditInfo-313-description=
$*CreditInfo-314-description=CCO
$*CreditInfo-315-description=Jangchoel Rhee
$*CreditInfo-316-description=
$*CreditInfo-317-description=
$*CreditInfo-318-description=
$*CreditInfo-319-description=<font color='#d99e36'><font size='36'>EXTENDED GLOBAL TEAM</FONT>
$*CreditInfo-320-description=
$*CreditInfo-321-description=
$*CreditInfo-322-description=
$*CreditInfo-323-description=<font color='#d99e36'><font size='18'>LOCALIZATION</FONT>
$*CreditInfo-324-description=
$*CreditInfo-325-description=<font color='#ffffff'><font size='18'>ALPHA CRC GAMES</FONT>
$*CreditInfo-326-description=<font color='#ffffff'><font size='18'>POLE TO WIN AMERICA, INC.</FONT>
$*CreditInfo-327-description=
$*CreditInfo-328-description=QA Localization Lead
$*CreditInfo-329-description=Jennifer Dugger
$*CreditInfo-330-description=
$*CreditInfo-331-description=Sr. QA Localization Tester
$*CreditInfo-332-description=Brian Piotrowski
$*CreditInfo-333-description=
$*CreditInfo-334-description=QA Localization Tester
$*CreditInfo-335-description=Lauren Albanese
$*CreditInfo-336-description=Tyler Byland
$*CreditInfo-337-description=Trevor Davies
$*CreditInfo-338-description=Cody Javonillo
$*CreditInfo-339-description=Corey Kemper
$*CreditInfo-340-description=Justin Merrill-Boyet
$*CreditInfo-341-description=Rachel Palit
$*CreditInfo-342-description=Justin Sklaroff
$*CreditInfo-343-description=Dusty Orais
$*CreditInfo-344-description=Joseph Kruso
$*CreditInfo-345-description=Jacob Hart
$*CreditInfo-346-description=Riley Scott
$*CreditInfo-347-description=Amethyst Skeels
$*CreditInfo-348-description=Christopher Yepes
$*CreditInfo-349-description=
$*CreditInfo-350-description=
$*CreditInfo-351-description=
$*CreditInfo-352-description=<font color='#ffffff'><font size='18'>4-REAL INTERMEDIA GMBH</FONT>
$*CreditInfo-353-description=
$*CreditInfo-354-description=Project Management
$*CreditInfo-355-description=Roger Schoenberg
$*CreditInfo-356-description=Claudia Schlicht
$*CreditInfo-357-description=
$*CreditInfo-358-description=Translation and Proofreading
$*CreditInfo-359-description=Laura Reutzel
$*CreditInfo-360-description=Saskia Eisenmenger
$*CreditInfo-361-description=Martina Glebocki
$*CreditInfo-362-description=Sabine Klosek
$*CreditInfo-363-description=Christoph Malecki
$*CreditInfo-364-description=Gideon Romano
$*CreditInfo-365-description=Tanja Reichard
$*CreditInfo-366-description=Julia Thull
$*CreditInfo-367-description=Robert Brodatzki
$*CreditInfo-368-description=Barbara Nobis
$*CreditInfo-369-description=Jan Schäfer
$*CreditInfo-370-description=Johannes Irmer
$*CreditInfo-371-description=Jan Steinbach
$*CreditInfo-372-description=Stefan Herzog
$*CreditInfo-373-description=Martin Monsberger
$*CreditInfo-374-description=Philipp Kolleritsch
$*CreditInfo-375-description=Steffen Nowak
$*CreditInfo-376-description=Susanne Schmidt-Wussow
$*CreditInfo-377-description=
$*CreditInfo-378-description=German Translator
$*CreditInfo-379-description=Tobias Kuerner
$*CreditInfo-380-description=
$*CreditInfo-381-description=Localization Manager
$*CreditInfo-382-description=Ludovic Bony
$*CreditInfo-383-description=Tobias Kuerner
$*CreditInfo-384-description=
$*CreditInfo-385-description=
$*CreditInfo-386-description=
$*CreditInfo-387-description=<font color='#ffffff'><font size='18'>XLOC, INC.</FONT>
$*CreditInfo-388-description=
$*CreditInfo-389-description=
$*CreditInfo-390-description=
$*CreditInfo-391-description=<font color='#d99e36'><font size='18'>VOICEOVER & SOUND</FONT>
$*CreditInfo-392-description=
$*CreditInfo-393-description=English Voiceover Cast
$*CreditInfo-394-description=Alan Adelberg
$*CreditInfo-395-description=Brent Miller
$*CreditInfo-396-description=Carol Cunningham
$*CreditInfo-397-description=Caroline Watson-Felt
$*CreditInfo-398-description=Chris Rando
$*CreditInfo-399-description=Chris Sharpes
$*CreditInfo-400-description=Dan Crislip
$*CreditInfo-401-description=David Attar
$*CreditInfo-402-description=David Godfrey
$*CreditInfo-403-description=DB Cooper
$*CreditInfo-404-description=Douglas Fox
$*CreditInfo-405-description=Dug Joy
$*CreditInfo-406-description=Eddie Dean
$*CreditInfo-407-description=Felecia Angelle
$*CreditInfo-408-description=Glen Gray
$*CreditInfo-409-description=Hannah Risser-Sperry
$*CreditInfo-410-description=Heather Masters
$*CreditInfo-411-description=Jared Martzell
$*CreditInfo-412-description=Jason LaShea
$*CreditInfo-413-description=Jason McKinnon
$*CreditInfo-414-description=Joey Phoenix
$*CreditInfo-415-description=Justin Dominic
$*CreditInfo-416-description=Keish Baker
$*CreditInfo-417-description=Lani Minella
$*CreditInfo-418-description=Larissa Gallagher
$*CreditInfo-419-description=Lex Lang
$*CreditInfo-420-description=Mavis Ada
$*CreditInfo-421-description=Michael Dobson
$*CreditInfo-422-description=Michael Schwalbe
$*CreditInfo-423-description=Nicholas Kallman
$*CreditInfo-424-description=Paul Sherrard
$*CreditInfo-425-description=Robert Holtz
$*CreditInfo-426-description=Ryan Laughton
$*CreditInfo-427-description=Sarah Edmondson
$*CreditInfo-428-description=Scott Reyns
$*CreditInfo-429-description=Tommy Campbell
$*CreditInfo-430-description=William Murphy
$*CreditInfo-431-description=
$*CreditInfo-432-description=Additional Voices
$*CreditInfo-433-description=Aaron Jackson    Adam Nicholls    Alexander Wong
$*CreditInfo-434-description=Anthony Castillo    Aurelien Guillemot    Ben Pahti
$*CreditInfo-435-description=Brandy Lukas    Brian Luong    Ceitros
$*CreditInfo-436-description=Caitlynn French    Cassidy Harris    Cameron Hutchison
$*CreditInfo-437-description=Cameron Hutchison   Dallin Carrel   Daniel Rivera
$*CreditInfo-438-description=Danielle Doane   Danny Navilio   David Angel
$*CreditInfo-439-description=Derrick Doyle   Earl of Bassington   Fahri Sakalli
$*CreditInfo-440-description=Fiona Kao   German Quiles   Guilherme Marques
$*CreditInfo-441-description=Haavard Ullensvang   Hallmat Waly   Heather Kreiling
$*CreditInfo-442-description=Jan Bartel   Jason Young   Joakim Paulsson
$*CreditInfo-443-description=Joseph E Budd II   Keith Gold   Kostadin Durchov
$*CreditInfo-444-description=Kristoffer Majer   Luca Eleuteri   Marcel Limprecht
$*CreditInfo-445-description=Mark Krajnc   Mayar Diban   Michael Howard
$*CreditInfo-446-description=Miranda Fenwick   Mustafa "Muzzy" Ercan   Quentin "Little Wolf" Syliboy
$*CreditInfo-447-description=Robert Needham   Roger Lewis   Roxanne Allphin
$*CreditInfo-448-description=Sabrina Simpson   Sara Catarina Rebelo Neto   Shae Kormos
$*CreditInfo-449-description=Stefan Fu   TaNeal Chandler   Tear’a Lyons
$*CreditInfo-450-description=Thomas Mamoru Evans   Tom Long   Tony Cole-Cocking
$*CreditInfo-451-description=Vanessa Schafer
$*CreditInfo-452-description=
$*CreditInfo-453-description=English Voiceover Audio Team
$*CreditInfo-454-description=SkewSound, LLC
$*CreditInfo-455-description=Dan Crislip
$*CreditInfo-456-description=Nicholas Kallman
$*CreditInfo-457-description=Christopher Wilson
$*CreditInfo-458-description=Steve Pardo
$*CreditInfo-459-description=
$*CreditInfo-460-description=Special Thanks
$*CreditInfo-461-description=The Character Talent Agency
$*CreditInfo-462-description=What He Said Voiceovers, LLC.
$*CreditInfo-463-description=
$*CreditInfo-464-description=Product Feedback & Development Help
$*CreditInfo-465-description=Nick Mhley
$*CreditInfo-466-description=Henry Martinez
$*CreditInfo-467-description=Amy Hong
$*CreditInfo-468-description=Chris Whiteside
$*CreditInfo-469-description=
$*CreditInfo-470-description=Community & Player Support
$*CreditInfo-471-description=Ingrid Hill
$*CreditInfo-472-description=Daniel Fahrtmann
$*CreditInfo-473-description=Don Hudson
$*CreditInfo-474-description=Henry Martinez
$*CreditInfo-475-description=
$*CreditInfo-476-description=Public Relations
$*CreditInfo-477-description=William Murphy
$*CreditInfo-478-description=Garrett Fuller
$*CreditInfo-479-description=
$*CreditInfo-480-description=Marketing
$*CreditInfo-481-description=Chris Lye
$*CreditInfo-482-description=
$*CreditInfo-483-description=Strategy & Business Development
$*CreditInfo-484-description=Chris Chung
$*CreditInfo-485-description=Jake Kim
